Router>enable
Router#configure ter
Router#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface F
Router(config)#interface FastEthernet 0/0
Router(config-if)#ip addres
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#inter
Router(config-if)#interface Fa
Router(config-if)#interface Fast
Router(config-if)#interface FastEhternet 0/1
                   ^
% Invalid input detected at '^' marker.
	
Router(config-if)#
Router(config-if)#inter
Router(config-if)#interface F
Router(config-if)#interface FastEhternet 0/1
                   ^
% Invalid input detected at '^' marker.
	
Router(config-if)#ip a
Router(config-if)#ip ad
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#show ip int
Router#show ip interface br
Router#show ip interface brief 
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/0        192.168.2.1     YES manual up                    down 
FastEthernet0/1        unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
Router#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router#configure ter
Router#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#inter
Router(config)#interface Fa
Router(config)#interface FastEthernet 0/1
Router(config-if)#ip address 192.168.2.1 255.255.255.0
% 192.168.2.0 overlaps with FastEthernet0/0
Router(config-if)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#show ip in
Router#show ip inter
Router#show ip interface br
Router#show ip interface brief 
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/0        192.168.2.1     YES manual up                    up 
FastEthernet0/1        192.168.2.1     YES manual administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
Router#
